In [1]:
import pandas as pd
import numpy as np

In [2]:
s1=pd.Series(np.arange(4),index=["a","c","d","e"])
s2=pd.Series(np.arange(5),index=["a","c","e","f","g"])

In [5]:
print(s1)#automatically prints each index of the Series
print(s2)

a    0
c    1
d    2
e    3
dtype: int64
a    0
c    1
e    2
f    3
g    4
dtype: int64

In [4]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [18]:
df1=pd.DataFrame(np.arange(6).reshape(2,3),columns=list("ABC"),index=["Tim","Tom"])#changes the arrangement from 1 row to the specified 2x3 matrix.  
#needs to have the proper amount of indexes and columns
df2=pd.DataFrame(np.arange(9).reshape(3,3),columns=list("ACD"),index=["Tim","Kate","Tom"])

In [7]:
print(df1)
print(df2)

     A  B  C
Tim  0  1  2
Tom  3  4  5
      A  B  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [21]:
df1+df2#the only intersecting columns and indexes are A,C and Tim and Tom, so everything else will have a NaN value

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [19]:
df1.add(df2,fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [22]:
1/df1

            A     B    C
Tim       inf  1.00  0.5
Tom  0.333333  0.25  0.2

In [23]:
df1*3

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [25]:
df1.mul(3)#another way of expressing the above function

     A   B   C
Tim  0   3   6
Tom  9  12  15